In [1]:
%load_ext sql

In [2]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [3]:
%sql sqlite:///my_data1.db

In [6]:
import pandas as pd
df = pd.read_csv("Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

In [8]:
# Remove blank rows from table
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

In [28]:
%sql select distinct Launch_Site from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

In [11]:
%sql select * from SPACEXTBL where Launch_Site like "CCA%" limit 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [31]:
%sql select sum("PAYLOAD_MASS__KG_") from SPACEXTBL where Customer = "NASA (CRS)"

 * sqlite:///my_data1.db
Done.

[(45596,)]

In [33]:
%sql select avg(PAYLOAD_MASS__KG_) from SPACEXTBL where Booster_Version = "F9 v1.1"

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

In [44]:
%sql select Date from SPACEXTBL where Landing_Outcome = 'Success (ground pad)' order by 1 limit 1

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

In [46]:
%sql select Booster_Version from SPACEXTBL where Landing_Outcome = 'Success (drone ship)' and PAYLOAD_MASS__KG_ between 4000 and 6000

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

In [52]:
%sql select count(Mission_Outcome) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(101,)]

In [59]:
%sql select max(PAYLOAD_MASS__KG_) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(15600,)]

In [63]:
%sql select Booster_Version from SPACEXTBL where PAYLOAD_MASS__KG_ = (select max(PAYLOAD_MASS__KG_) from SPACEXTBL)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

In [73]:
%sql select substr(Date, 6,2) as Month, Landing_Outcome, booster_version, launch_site from SPACEXTBL where substr(Date,0,5)='2015' and Landing_Outcome = 'Failure (drone ship)'

 * sqlite:///my_data1.db
Done.

[('01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

In [77]:
%sql select count(landing_outcome) from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(101,)]

In [84]:
%sql select date, count(landing_outcome) from SPACEXTBL where date between '2010-06-04' and '2017-03-20' group by 1 order by count(landing_outcome) desc

 * sqlite:///my_data1.db
Done.

[('2017-03-16', 1),
 ('2017-02-19', 1),
 ('2017-01-14', 1),
 ('2016-08-14', 1),
 ('2016-07-18', 1),
 ('2016-06-15', 1),
 ('2016-05-27', 1),
 ('2016-05-06', 1),
 ('2016-04-08', 1),
 ('2016-03-04', 1),
 ('2016-01-17', 1),
 ('2015-12-22', 1),
 ('2015-06-28', 1),
 ('2015-04-27', 1),
 ('2015-04-14', 1),
 ('2015-03-02', 1),
 ('2015-02-11', 1),
 ('2015-01-10', 1),
 ('2014-09-21', 1),
 ('2014-09-07', 1),
 ('2014-08-05', 1),
 ('2014-07-14', 1),
 ('2014-04-18', 1),
 ('2014-01-06', 1),
 ('2013-12-03', 1),
 ('2013-09-29', 1),
 ('2013-03-01', 1),
 ('2012-10-08', 1),
 ('2012-05-22', 1),
 ('2010-12-08', 1),
 ('2010-06-04', 1)]